IDEA Open Model
PrestressInputType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Type of input of prestressing
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum PrestressInputType
Public Enumeration PrestressInputType
Members
Member name | Value | Description
AfterTransfer | 1 |  stress after transfer - long term losses will be calculated
AfterLongTermLosses | 3 |  stress after long term losses is added to tendon
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace